kafka integration
